# Reading an excel file using Python
# import openpyxl
# import xlrd
from backend.Translate import Translate
import time

class testing:
    def complete(self,data):
        sentence = ''
        for get in data:
            if(type(get) is list):
                sentence += " "+str(get[0])
            else:
                sentence += " " + str(get)
        sentence_s = sentence.strip()
        return sentence_s

    def testing(self):
        # Give the location of the file
        loc = ("sentence100_test.xlsx")

        wb = xlrd.open_workbook(loc)
        sheet = wb.sheet_by_index(0)
        sheet.cell_value(0, 0)

        wb_s = openpyxl.Workbook()
        sheet_s = wb_s.active

        tran = Translate()
        start =1
        data_translated =[]
        cc = 0
        header=['ประโยคที่มีคำว่าของ','ประโยคคำถาม','ประโยคที่มีการบอกลักษณะนาม','ประโยคที่มีการใช้ โดย']
        for i in range(sheet.nrows-start):
            get_thai = sheet.cell_value(i+start, 1)
            sentence_thai =str(get_thai)
            # print(sentence_thai,"\n")

            if(sentence_thai not in header):
            # sentence_thai = 'บ้านของฉัน'
                cc+=1
                sentence_hmong = self.complete(tran.traslateThaiHmong(sentence_thai)[0])
            else:
                sentence_hmong =''
            data_translated.append((sentence_thai,sentence_hmong))
        print(data_translated)
        print("จำนวนประโยค :",cc)

        print("\n---------------------------------------------------------------\n")
        for get in data_translated:
            print(get[1])

    def translate(self,sentence):
        tran = Translate()
        sentence_hmong = self.complete(tran.traslateThaiHmong(sentence)[0])
        # print(sentence_hmong)
        return sentence_hmong

if __name__ == '__main__':

    a= testing()
    # a.testing()

    text ="""
เป็นอย่างไรบ้าง
สบายดีไหม
แล้วคุณล่ะ
ผมสบายดี ขอบคุณ แล้วคุณล่ะ
สวัสดี คุณเป็นยังไงบ้าง
สวัสดี ฉันสบายดี ขอบคุณ แล้วคุณล่ะ
ผมสบายดี ขอบคุณ คุณจะไปที่ไหน
ฉันกำลังไปห้องสมุด คุณไปไหม
สบายดี ขอบคุณ แล้วคุณล่ะ
เธอมาจากที่ไหน
นี่คือ
นี่คือ และนั่นคือ
นั่นใครน่ะ
เราเคยพบกันมาก่อนไหม
สวัสดี ผู้หญิงคนนี้เป็นใครหรือ 
ช่วยแนะนำให้ผมรู้จักหน่อยได้ไหม
เธอมาจากไหน
วันเกิดคุณคือวันไหน
คุณเกิดเมื่อไร
ฉันเกิดปี
วันเกิดของคุณคือเมื่อไหร่
หล่อนเกิดเมื่อไหร่
คุณชื่ออะไร
ชื่อของคุณคือ
ชื่อเล่นของคุณคือ
คุณเป็นใคร
นามสกุลของคุณคือ
คุณสะกดมันยังไง
คุณอายุเท่าไร
คุณเกิดวันที่เท่าไร
คุณเกิดวันอะไร
คุณเกิดเมื่อไหร่
คุณเกิดที่ไหน
คุณสูงเท่าไร
คุณหนักเท่าไร
คุณมาจากไหน
คุณมีสัญชาติอะไร
คุณแต่งงานหรือยัง
คุณมีลูกบ้างไหม
คุณมีลูกกี่คน
พวกเขาเรียนที่ไหน
สามีคุณทำงานอะไร
บ้านเกิดของคุณอยู่ที่ไหน
ตอนนี้คุณพักที่ไหน
บ้านคุณอยู่ที่ไหน
ที่อยู่ของคุณคือที่ไหน
ครอบครัวคุณมีกี่คน
คุณมีพี่น้องทั้งหมดกี่คน
คุณมีพี่น้องบ้างไหม
พ่อแม่ของคุณทำงานหรือเปล่า
พวกเราทำงานอะไร
ตอนนี้คุณอยู่กับพ่อแม่หรือเปล่า
คุณอยู่คนเดียวเหรอ
พ่อแม่ของคุณยังมีชีวิตอยู่หรือเปล่า
แม่ของฉันสบายดี
คุณอาศัยอยู่ที่ไหน
คุณอาศัยอยู่ในเมืองอะไร
คุณอาศัยอยู่ในจังหวะอะไร
บ้านของเธออยู่ที่ไหน
คุณทำงานอะไร
คุณทำอาชีพอะไร
ตอนนี้คุณทำอะไรอยู่
อาชีพของคุณคืออะไร
คุณเป็น ใช่ไหม
คุณทำงานที่ไหน
เงินเดือนคุณเท่าไร
คุณได้เงินเดือนเท่าไร
คุณมีรายได้เดือนเท่าไร
คุณได้ค่าจ้างวันเท่าไร
คุณชอบอะไรในงานที่ทำอยู่
แล้วถ้าคุณได้งานที่อยู่ไกลบ้าน
สวัสดี วันหยุดเป็นอย่างไรบ้าง
ดีจังเลย แล้วบ้านเกิดคุณอยู่ไหนล่ะ
อยู่ที่ไหน
แล้วพ่อแม่คุณล่ะ เป็นยังไงบ้าง
เสียใจด้วยนะ ตอนนี้แม่คุณก็อยู่ที่บ้าน
ไม่ได้เจอกันนานเลยนะ ตอนนี้ทำงานอะไรอยู่
คุณทำหน้าที่อะไรบ้าง
เธออยากเป็นอะไรเมื่อเธอโตขึ้น
ขอโทษ คุณรู้ไหมว่า อยู่ที่ไหน
คุณรู้ทางไปไหม
ถนนเส้นนี้ไปถึงหรือเปล่า
ฉันจะไปที่นั่นได้อย่างไร
นี่เป็นทางไปที่นั่นใช่ไหม
ที่นั่นอยู่ที่ไหน
ทางไหนคือทางไป
ให้ผมพาคุณไปที่ไหน
คุณกำลังจะไปที่ไหน
ค่ารถเท่าไร
ขอโทษทางนี้ไปที่นั่นใช่ไหม
คืนนี้ไปกินข้าวด้วยกันไหม
พรุ่งนี้ไปกินข้าวที่ไหน
คืนนี้คุณอยากไปกินข้าวกับผมไหม
ได้สิ เราจะไปที่ไหนดี
เธอจะไปร่วมกับพวกเราไหม
เราไปหาอะไรดื่มไหม
ดื่มน้ำไหม
สบายดี ขอบคุณ แล้วคุณล่ะ
สบายดี คุณอยากกินข้าวกับผม
จะให้ไปรับกี่โมง
คุณอยากจะพักไหม
พวกเราไปได้หรือยัง
คุณอยู่ที่นั่นไหม
คุณเรียนที่ไหน
ครูของคุณเป็นใคร
ครูของคุณชื่ออะไร
คุณเรียนคณะอะไร
วิชาอะไรที่คุณชอบ
วิชาที่คุณชอบที่สุดคือวิชาอะไร
คุณชอบทำอะไรในเวลาว่าง
กิจกรรมที่คุณสนใจคืออะไร
คุณมีเรียนบ่อยแค่ไหน
ห้องเรียนคุณเริ่มกี่โมง
คุณเลิกเรียนกี่โมง
บ่ายนี้คุณมีเรียนหรือเปล่า
คุณไปโรงเรียนทุกวันไหม
คุณเดินทางไปโรงเรียนอย่างไร
คุณเรียนจบหรือยังเรียนไม่จบ
การศึกษาสูงสุดของคุณคืออะไร
คุณเรียนหลักสูตรอะไร
คุณไปโรงเรียนประเภทไหน
ฉันเรียนจบที่
คุณเรียนจบที่ไหนมา
คุณเรียนชั้นปีไหน
เธอมีปัญหาอะไรไหม
มันคืออะไร
เธออยู่ชั้นไหน
คุณได้ไปที่โรงเรียนมาหรือเปล่า
คุณเคยไปที่โรงเรียนไหม
คุณกำลังจะไปที่โรงเรียนใช่ไหม
เราจะไปไหน
คุณกำลังจะไปไหน
คุณเดินทางโดยถยนต์ใช่ไหม
คุณชอบท่องเที่ยวไหม
คุณท่องเที่ยวบ่อยไหม
คุณไปที่โรงเรียนบ่อยแค่ไหน
คุณไปเที่ยวที่ไหนในวันหยุดที่ผ่านมา
คุณเคยเดินทางไปกี่ประเทศแล้ว
 คุณไปที่ไหนมา
คุณชอบไปโรงเรียนไหม
มันจะใช้เวลานานเท่าไร
คุณชอบขึ้นเครื่องบินไหม
คุณจะไปโดยเครื่องบินหรือรถยนต์
วันพรุ่งนี้คุณจะไปเที่ยวใช่ไหม
คุณจะออกจากที่บ้านตอนกี่โมง
คุณว่าดีไหม
คุณว่าฉันควรไปเที่ยวเมื่อไหร่ดี
คุณพอจะมีเวลาว่างบ้างไหม
วันพรุ่งนี้คุณว่างไหม
มันน่าสนใจตรงไหนหรือ
ที่ทะเลมีอะไรน่าสนใจบ้าง
คุณรู้สึกประทับใจอะไรที่ทะเล
ตอนนี้เราอยู่ที่ไหน
ที่นี่คือ
ขณะนี้พวกเราอยู่ที่
เราต้องมีคนนำทางไหม
คิดราคาชั่วโมงล่ะเท่าไร
คุณพูดภาษาไทยได้ไหม
คุณเข้าใจภาษาไทยไหม
ขอโทษ ไม่ทราบว่าคุณพูดอะไร
คุณออกเสียงคำนี้อย่างไร
คำนี้หมายความว่าอย่างไร
คุณสะกดคำนี้อย่างไร
คำนี้คุณออกเสียงอย่างไร
ช่วงนี้ คุณทำอะไรบ้าง
จริงหรือ คุณไปที่ไหนมา
เช้านี้คุณสบายดีไหม
เมื่อคืนนอนหลับดีไหม
คุณพร้อมจะไปเที่ยวหรือยัง
พวกเราจะไปที่ไหนดี
เราควรจะไปที่ไหนก่อน
ที่คุณต้องการไป
มีสิ่งน่าสนใจไหม
ใช่ มีอะไรให้ฉันช่วยไหม
คุณกำลังไปที่ไหน
อากาศเป็นอย่างไรบ้าง
เหมือนฝนจะตกใช่ไหม
อากาศที่บ้านเป็นอย่างไรบ้าง
คุณคิดอย่างไรกับอากาศที่บ้าน
ที่นั่นอากาศร้อนไหม


    """
    text = text.strip()
    text = text.splitlines()
    all = []
    for sentence in text:
        sentence = sentence.strip()
        all.append(a.translate(sentence))
    print("\n\n")
    for sentence in all:
        print(sentence)

